org/macros.org
#+Date: 10 September 2021

#+Title: Notes on Macros

* Introduction

What follows is an evolving set of notes on Common Lisp Macros. Over time I hope to refine and correct the concepts outlined below. Hopefully at some point in the future I will be able to hold the below in greater regard, and until then, reader beware.

*Macros* are functions that generate Lisp code, programs that write programs. Macros are important in writing good code as they make it possible to write code that is clear and elegant at the user level but which is converted to a more complex or more efficient internal form for execution. Common Lisp has been well-designed to make full use of macros, a point we will touch upon later, and thus a sound understanding of how macros work and how and when to use them is useful for any programmer who has chosen to program in Lisp over other languages.

That said, it is not always clear when to use macros and when to use functions as they can both be used in many cases to achieve similar outcomes. Hopefully this guide will help expand on some of the considerations when to use either, but as a starting point, one approach is to consider the /purpose/ behind our code:

- When we are writing code to directly solve real world problems, that is, when our code adds /functionality/ to our applications, a function may likely be the best choice

- When we want to streamline how we write our code, by defining shorthand syntax for common blocks of code instructions, macros may well likely be more appropriate

In this sense, macros extend the language while functions use the language.

* Why use macros?



