macros.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-17 Fri 22:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Notes on Macros</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="quote">Ashok Khanna</div>
<div id="home-link"><a href="/index.html">Home</a></div>
<div id="articles-link"><a href="/articles.html">Articles</a></div>
<div id="resources-link"><a href="/resources.html">Resources</a></div>
</div>
<div id="content">
<h1 class="title">Notes on Macros</h1>

<div id="outline-container-orgc6007a0" class="outline-2">
<h2 id="orgc6007a0">Introduction</h2>
<div class="outline-text-2" id="text-orgc6007a0">
<p>
What follows is an evolving set of notes on Common Lisp Macros. Over time I hope to refine and correct the concepts outlined below. Hopefully at some point in the future I will be able to hold the below in greater regard, and until then, reader beware.
</p>

<p>
<b>Macros</b> are functions that generate Lisp code, programs that write programs. Macros are important in writing good code as they make it possible to write code that is clear and elegant at the user level but which is converted to a more complex or more efficient internal form for execution. Common Lisp has been well-designed to make full use of macros, a point we will touch upon later, and thus a sound understanding of how macros work and how and when to use them is useful for any programmer who has chosen to program in Lisp over other languages.
</p>

<p>
That said, it is not always clear when to use macros and when to use functions as they can both be used in many cases to achieve similar outcomes. Hopefully this guide will help expand on some of the considerations when to use either, but as a starting point, one approach is to consider the <i>purpose</i> behind our code:
</p>

<ul class="org-ul">
<li>When we are writing code to directly solve real world problems, that is, when our code adds <i>functionality</i> to our applications, a function may likely be the best choice</li>

<li>When we want to streamline how we write our code, by defining shorthand syntax for common blocks of code instructions, macros may well likely be more appropriate</li>
</ul>

<p>
In this sense, macros extend the language while functions use the language.
</p>
</div>
</div>
