org/macros.org
* What makes Lisp macros special?

The capabilities of the Lisp macro system is a consequence of the language design. To understand better, we take a step back and look at how compilers work. In every programming language, the starting point is typing characters or strings via our keyboards onto the machine. Maybe we don't directly type our programs all the time and rather copy parts from Stack Overflow or some other source (such as an existing file), but the key point here is the starting point is text.

After we type in our programs as text, the compiler or interpreter needs to parse them into a form it can recognise, such as an [[file:https://en.wikipedia.org/wiki/Abstract_syntax_tree][abstract syntax tree]]. As Paul Graham writes on page 83 of On Lisp, here's the stroke of genius: the output of the (Lisp) parser consists of /lists of Lisp objects/. The textual language we type our Lisp programs in is the same form as the parsed abstract syntax tree, both being lists of lisp objects. The lines between the printed (textual) representation of our programs with their internal form is blurred, and it is this feature, together with Lisp being a highly capable list processor and access to the (relatively simple) Lisp parser, that makes Lisp macros special.

Two defining features of Lisp are its *prefix form* and its *parentheseses*. Prefix form means we write our operators before our operands, such as /+ 1 2 3 4/ vs. /1 + 2 + 3 + 4/ (the later being an example of infix languages). The benefit of prefix form is its unambiguous structure - the first item is always the operator and the remainder items are always the operands. With infix form, one would need to analyse each object and determine whether it is an operator or an operand. Whilst not insurmountable, this difference makes it more difficult to parse programming languages which adopt an infix style (which many popular languages do).

The second defining feature of Lisp is its copuious use of parentheses. Each expression in Lisp is delimited by a starting and ending parenthesis. The result of this is that the nesting structure of a program in Lisp is again unambiguous, as its explicitly written via the parentheses. Again, in other languages, the nested structure of programs is more implicit and the parser must analyse a block of code to obtain its nested structure. It is true that the use of curly brackets does express a lot of the structure of a program, but there is hidden level of complexity in parsing individual expressions as they too contain various subparts, and the nested structure of the compound expression needs to be parsed as it varies between different expressions.

The net result of the preceding two points is that Lisp is written in an explicit form that requires very little parsing and in fact is written in a form that directly represents the resultant abstract syntax tree, whilst most other languages need an intermediary parsing step to transform the textual form of programs to the parsed form ready for use by the compiler.

It is a small step of logic to then see why Lisp macros are inherently more capable than macros in other languages - by writing and having full access to the abstract syntax tree, it is a much easier (and consequently more robust) process to transform, manipulate and generate code programatically, as we are effectively always working within the abstract syntax tree and are unencumbered by the added complexity of having to parse the implicit assumptions contained within our textual representation of our programs. For example, implicit knowledge of the fact that addition is a binary operation is required to be able to parse /1 + 2 + 3 + 4 + 5/ as we then know that each addition must have a number on the left and a number on the right. On the other hand, /3 4 + 5/ is an incorrectly formed expression, but we only know this when we apply our implicit knowledge of how addition works to the expression. On the other hand in Lisp, everything is mostly explicit and relatively straightforward - (3 4 + 5) gives an error because the first item is not an operator, and (+ 3 4 + 5) gives an error because one of the remaining items (after the first) is a function (+) and not an operaand. Note how both of these errors are unrelated to any underlying assumptions of how addition works.

It wouldn't be fair to stop there, and not note that the preceding discussion is slightly misleading. There /are/ implicit assumptions in Lisp code, for example (+ 3 4 "asdf") will give an error because we have passed in a string when we expected a number. The point however (and something hopefully you can verify once you use Lisp in detail and use other languages in detail) is that there are significantly less of these implicit assumptions that need to be made in Lisp.

There is a corollary point to be made here. The explicit, consistent and structured approach used by Lisp adds to its complexity in reading code. The jury is out for experienced Lispers, but for most programmers, Lisp code is considered more unreadable. Two of the reasons are that infix notation is more natural in many cases as that is what we are used to (especially in mathematics). To me, it is easier to read "allCars LESS myCar" to get a set of all cars except mine, vs. (LESS all-cars my-car). On an individual expression level, it is an exceptionally minor difference, however in big programs, these will add up.

The next point is that other languages make use of more syntatical tokens than Lisp, newlines, whitespace, semi-colons, brackets, curly braces, colons and the list goes on. All of these extra tokens add complexity in parsing, but they do help in readability. They allow us to latch onto different parts of a program and differentiate parts from each other. On the other hand, everything is a list in Lisp, so again it is left to the (human) reader to mentally parse lisp code and and load it into their cognition.

As a consequence of the above, I believe an argument can be formed. Humans are relatively advanced parsers and can work easily with implicit assumptions, varying syntax, and to some extent prefer such approaches as it allows them to quickly digest information. Computers are much more mechanical and need these rules written down for them. The consequence of Lisp being designed as a relatively simple language that makes it easy to parse, which allows for a near one-to-one congruentity between what we type and what is parsed, has an equivalent downside when it comes to code readability. For other languages, the paradigm is reversed.

It is no wonder that for many straightforward programs, it is more beneficial to write in other languages, as code readability is arguably one of the most important features of a programming language. Otherwise, we would all be writing in machine code. All that said, and without ending this article unnecessarily early, the benefits of the Lisp macro system, which as we have hopefully explained, is a consequence of the language itself and cannot be easily replicated as such, can be argued to outweigh the loss in code readability, and is one of the reasons behind the ferverent support Lisp has among its supporters.

We can train ourselves in reading Lisp code, and after some time, it will get much easier. By doing this hard work in getting acquainted with Lisp, we then are left with a highly powerful macro system and a wonderful set of potential opportunities to write and deploy elegant programs. Again quoting Paul Graham (in abridged form), with (lisp) macros we can manipluate programs (and) if necessary, these anipulations can be very extensive. A macro has at its dispotion the full power of Lisp. Being able to change what the compiler sees is almost like being able to rewrite it. We can add any construct to the language that we can define by transformation into existing constructs.

The benefit of macros come from composability. They represent another (very useful) mechanism to break down our programs into more composable parts, abstracting away certain structures at not just the function level, but rather the language level, and this is very useful in writing complex programs. For those interested, SICP is a great introductory read on related topics, which explains the beauty and usefulness of a considered approach to program design that focuses on breaking down programs as much as possible into smaller, distinct, easily testable and easily reusable parts.

Note: Another benefit of the Lisp macro system is that Lisp grants the user full access to the parser, which may not be the case in other languages, which requires users to re-implement their own (potentially inaccurate, especially given the added complexity in parsing such languages) parsers. Whilst parsing is much easier to do in Lisp, conceptually, this access to the full parser is not inherently only intrinsic to Lisp and can be provided by other languages, should they wish to. Accordingly, I have not made much note of this practical difference in the above, although it is a significant source behind the added capabilities of Lisp macros vs. other languages. One can only assume that other languages will catch up and provide users full access to their parsers eventually.

From stack overflow: https://stackoverflow.com/questions/267862/what-makes-lisp-macros-so-special

In most programming languages, syntax is complex. Macros have to take apart program syntax, analyze it, and reassemble it. They do not have access to the program's parser, so they have to depend on heuristics and best-guesses. Sometimes their cut-rate analysis is wrong, and then they break.

But Lisp is different. Lisp macros do have access to the parser, and it is a really simple parser. A Lisp macro is not handed a string, but a preparsed piece of source code in the form of a list, because the source of a Lisp program is not a string; it is a list. And Lisp programs are really good at taking apart lists and putting them back together. They do this reliably, every day.

Conclusion: To conclude:
- Lisp macros are powerful because of the homoicinty of the Lisp language
- A consequence of which is that lisp can be harder to read
- 


