org/macros.org
* A Mechanical Definition of Macros

We will start by providing a mechanical overview of how macros work, an approach that works suprisingly well in understanding their use. A note to the pedantic, we /will/ skip some details here (and perhaps slightly misrepresent certain items) in favour of a simpler conceptual overview.

The =DEFMACRO= form is used to define macros in the global environment. To quote the Common Lisp HyerSpec, DEFMACRO (with name /name/) defines /name/ as a macro by associating a *macro function* with that /name/ in the global environment. A macro function is a function of two arguments, a form and an environment, that implements macro expansion by producing a form to be evaluated in place of the original argument form.

Loosely speaking, in the below example, DEFMACRO associates the name =WHILE= with a macro function, which will allow the expansion contained in the body below to be produced when called.

#+begin_src lisp

  (defmacro while (test &body body)
    `(do () ((not ,test)) ,@body))
  
#+end_src

One can consider the above form, turns into something like the following.

#+begin_src lisp

  (setf (macro-function 'while)
	(lambda (form environment)
	  ()))

#+end_src

The body of a DEFMACRO form can be anything and it must return an expression to be evaluated. For example, consider the contrived example below. We perform a very simple transformation of the input text as part of the macro. 

#+begin_src lisp

  (defmacro contrived-1 (text)
    (let ((extra-text (format nil "Here is some text: ~a" text)))
      `(print ,extra-text)))

  (contrived-1 "Hello, World!")

  > "Here is some text: Hello, World!"

#+end_src

Let's try the following now.

#+begin_src lisp

()  (defmacro contrived-2 (text)
      (let ((extra-text (format nil "Here is some text: ~a" text)))
	(print extra-text)))

  (contrived-2 "Hello, World!")

  > "Here is some text: Hello, World!"

#+end_src

It still works! However, we haven't really learnt much. These examples are not different in any way to a function if we replaced DEFMACRO with DEFUN. Let's try the following now.

#+begin_src lisp

  (defmacro contrived-3 ()
    (defun contrived-3-fn () (print "Test")))

  (contrived-3-fn)
  > Error - Undefined Function

  (contrived-3)
  > Error - The variable contrived-3-fn is unbound

#+end_src

* Controlling Evaluation

** Introducing the Quote Special Form

We mentioned earlier that controlling evaluation was one of the two key usages of macros was controlling evaluation. This is a slightly nuanced topic and we will expand more on it here.

The special form =QUOTE= is used to prevent evaluation. The expression =(quote x)= simply returns /x/ without evaluating it. Ultimately, outside of the special forms, which have their own unique evaluation rules, all techniques to control evaluation ultimately rely on usage of the =QUOTE= function.

Quoting is not unique to macros, but rather is available (and used fairly extensively) throughout lisp programs. Let us consider two examples.

#+begin_src lisp

  (list 1 2 (+ 1 2))

  > returns (list 1 2 3)

  (list 1 2 (quote (+ 1 2)))

  > returns (list 1 2 (+ 1 2))

#+end_src

If you recall, Lisp looks at the CAR of the list to determine how to evaluate the list. In both of the above cases, Lisp will encounter LIST and therefore will construct a list consisting of the remaining elements of the original list being processed. As LIST is a function, Lisp will evaluate each of the remaining items. In the first example, above, 1 evaluates to 1, 2 evaluates to 2 and (+ 1 2) evaluates to 3.

On the other hand, look at the second example above. The QUOTE operator prevents evaluation of (+ 1 2), and simply returns it. This explains the result of the second example.

The reader macro ='= can be used as shorthand for quoting, thus the below two are equivalent:

#+begin_src lisp

  (list 1 2 (quote (+ 1 2)))

  (list 1 2 '(+ 1 2)) eval

#+end_src

The benefit of the latter is that it looks much closer to the final result (1 2 (+ 1 2)) and this additional clarity in reading & writing Lisp code cannot be underestimate.

** Preventing & Delaying Evaluation

What we have discussed thus far is /preventing/ evaluation. If that was all we wanted to do, we wouldn't really need macros. The next thing to consider is /delaying/ evaluation. There are two primary ways to do this, with the first being the =EVAL= function.

=EVAL= evaluates the supplied form in the current dynamic environment and the null lexical environment. Let us look at two examples:

#+begin_src lisp

  '(+ 1 2)

  > returns (+ 1 2)

  
  (eval '(+ 1 2))

  > returns 3

#+end_src

The first is a simple application of the quote function, returning the list (+ 1 2) as output. The =EVAL= in the second example evaluates this form to return 3. Note that EVAL is just a regular function, and thus first its argument, namely '(+ 1 2), is evaluated to return (+ 1 2), and then EVAL is applied on this argument to return 3. In this way,  since a single evaluation already occurs for any argument form in any function form, eval is said to perform "an extra level of evaluation."

The key point to note here is that a combination of quoting and eval allows us to delay evaluation. Quoting prevents evaluation and eval turns on evaluation. However, this has nothing to do with macros, we are working with lisp-wide functions here.

** More on Eval

There are a couple of considerations with =EVAL= that macros overcome. The first is that EVAL is a function, and thus runs during runtime. This can make eval considerably slower than the macro alternative we introduce shortly, which does a lot of its work at compile time. However, there are times we want to access information available at runtime, so this is not only a negative, just a point of differentiation.

What is a significant disadvantage to =EVAL= is that it does not have access to the lexical environment. Try the following.

#+begin_src lisp

  (defparameter *y* 0)
  
  (let ((x 1))
    (eval '(+ 1 x)))

  > Error - x is unbound
  
  (let ((x 1))
    (eval (+ 1 x)))

  > Returns 2

  (let ((x 1))
    (eval (+ 1 *y*)))

  > Returns 1

#+end_src

The error in the first example is because =EVAL= does not have access to the lexical environment where X is defined. The second example works because (+ 1 X) has been evaluated prior to reaching eval, and as a regular form, it has access to the lexical variable x. In this instance, eval receives 2, which it then evaluates to 2. The final example above shows that EVAL does have access to the current dynamic environment, where we have defined *Y* as a dynamic variable.

