macros.html


<div id="outline-container-org29de503" class="outline-2">
<h2 id="org29de503">A Mechanical Definition of Macros</h2>
<div class="outline-text-2" id="text-org29de503">
<p>
We will start by providing a mechanical overview of how macros work, an approach that works suprisingly well in understanding their use. A note to the pedantic, we <i>will</i> skip some details here (and perhaps slightly misrepresent certain items) in favour of a simpler conceptual overview.
</p>

<p>
The <code>DEFMACRO</code> form is used to define macros in the global environment. To quote the Common Lisp HyerSpec, DEFMACRO (with name <i>name</i>) defines <i>name</i> as a macro by associating a <b>macro function</b> with that <i>name</i> in the global environment. A macro function is a function of two arguments, a form and an environment, that implements macro expansion by producing a form to be evaluated in place of the original argument form.
</p>

<p>
Loosely speaking, in the below example, DEFMACRO associates the name <code>WHILE</code> with a macro function, which will allow the expansion contained in the body below to be produced when called.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">while</span> (test <span style="color: #228b22;">&amp;body</span> body)
  `(<span style="color: #a020f0;">do</span> () ((not ,test)) ,@body))

</pre>
</div>

<p>
One can consider the above form, turns into something like the following.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(setf (macro-function 'while)
      (<span style="color: #a020f0;">lambda</span> (form environment)
        ()))

</pre>
</div>

<p>
The body of a DEFMACRO form can be anything and it must return an expression to be evaluated. For example, consider the contrived example below. We perform a very simple transformation of the input text as part of the macro. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">contrived-1</span> (text)
  (<span style="color: #a020f0;">let</span> ((extra-text (format nil <span style="color: #8b2252;">"Here is some text: ~a"</span> text)))
    `(print ,extra-text)))

(contrived-1 <span style="color: #8b2252;">"Hello, World!"</span>)

&gt; <span style="color: #8b2252;">"Here is some text: Hello, World!"</span>

</pre>
</div>

<p>
Let's try the following now.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
()  (<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">contrived-2</span> (text)
      (<span style="color: #a020f0;">let</span> ((extra-text (format nil <span style="color: #8b2252;">"Here is some text: ~a"</span> text)))
        (print extra-text)))

  (contrived-2 <span style="color: #8b2252;">"Hello, World!"</span>)

  &gt; <span style="color: #8b2252;">"Here is some text: Hello, World!"</span>

</pre>
</div>

<p>
It still works! However, we haven't really learnt much. These examples are not different in any way to a function if we replaced DEFMACRO with DEFUN. Let's try the following now.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">contrived-3</span> ()
  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">contrived-3-fn</span> () (print <span style="color: #8b2252;">"Test"</span>)))

(contrived-3-fn)
&gt; Error - Undefined Function

(contrived-3)
&gt; Error - The variable contrived-3-fn is unbound

</pre>
</div>
</div>
</div>

<div id="outline-container-org246d1b7" class="outline-2">
<h2 id="org246d1b7">Controlling Evaluation</h2>
<div class="outline-text-2" id="text-org246d1b7">
</div>
<div id="outline-container-orgbfd694b" class="outline-3">
<h3 id="orgbfd694b">Introducing the Quote Special Form</h3>
<div class="outline-text-3" id="text-orgbfd694b">
<p>
We mentioned earlier that controlling evaluation was one of the two key usages of macros was controlling evaluation. This is a slightly nuanced topic and we will expand more on it here.
</p>

<p>
The special form <code>QUOTE</code> is used to prevent evaluation. The expression <code>(quote x)</code> simply returns <i>x</i> without evaluating it. Ultimately, outside of the special forms, which have their own unique evaluation rules, all techniques to control evaluation ultimately rely on usage of the <code>QUOTE</code> function.
</p>

<p>
Quoting is not unique to macros, but rather is available (and used fairly extensively) throughout lisp programs. Let us consider two examples.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(list 1 2 (+ 1 2))

&gt; returns (list 1 2 3)

(list 1 2 (quote (+ 1 2)))

&gt; returns (list 1 2 (+ 1 2))

</pre>
</div>

<p>
If you recall, Lisp looks at the CAR of the list to determine how to evaluate the list. In both of the above cases, Lisp will encounter LIST and therefore will construct a list consisting of the remaining elements of the original list being processed. As LIST is a function, Lisp will evaluate each of the remaining items. In the first example, above, 1 evaluates to 1, 2 evaluates to 2 and (+ 1 2) evaluates to 3.
</p>

<p>
On the other hand, look at the second example above. The QUOTE operator prevents evaluation of (+ 1 2), and simply returns it. This explains the result of the second example.
</p>

<p>
The reader macro <code>'</code> can be used as shorthand for quoting, thus the below two are equivalent:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(list 1 2 (quote (+ 1 2)))

(list 1 2 '(+ 1 2)) eval

</pre>
</div>

<p>
The benefit of the latter is that it looks much closer to the final result (1 2 (+ 1 2)) and this additional clarity in reading &amp; writing Lisp code cannot be underestimate.
</p>
</div>
</div>

<div id="outline-container-org1d27675" class="outline-3">
<h3 id="org1d27675">Preventing &amp; Delaying Evaluation</h3>
<div class="outline-text-3" id="text-org1d27675">
<p>
What we have discussed thus far is <i>preventing</i> evaluation. If that was all we wanted to do, we wouldn't really need macros. The next thing to consider is <i>delaying</i> evaluation. There are two primary ways to do this, with the first being the <code>EVAL</code> function.
</p>

<p>
<code>EVAL</code> evaluates the supplied form in the current dynamic environment and the null lexical environment. Let us look at two examples:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
'(+ 1 2)

&gt; returns (+ 1 2)


(eval '(+ 1 2))

&gt; returns 3

</pre>
</div>

<p>
The first is a simple application of the quote function, returning the list (+ 1 2) as output. The <code>EVAL</code> in the second example evaluates this form to return 3. Note that EVAL is just a regular function, and thus first its argument, namely '(+ 1 2), is evaluated to return (+ 1 2), and then EVAL is applied on this argument to return 3. In this way,  since a single evaluation already occurs for any argument form in any function form, eval is said to perform "an extra level of evaluation."
</p>

<p>
The key point to note here is that a combination of quoting and eval allows us to delay evaluation. Quoting prevents evaluation and eval turns on evaluation. However, this has nothing to do with macros, we are working with lisp-wide functions here.
</p>
</div>
</div>

<div id="outline-container-org8199af2" class="outline-3">
<h3 id="org8199af2">More on Eval</h3>
<div class="outline-text-3" id="text-org8199af2">
<p>
There are a couple of considerations with <code>EVAL</code> that macros overcome. The first is that EVAL is a function, and thus runs during runtime. This can make eval considerably slower than the macro alternative we introduce shortly, which does a lot of its work at compile time. However, there are times we want to access information available at runtime, so this is not only a negative, just a point of differentiation.
</p>

<p>
What is a significant disadvantage to <code>EVAL</code> is that it does not have access to the lexical environment. Try the following.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*y*</span> 0)

(<span style="color: #a020f0;">let</span> ((x 1))
  (eval '(+ 1 x)))

&gt; Error - x is unbound

(<span style="color: #a020f0;">let</span> ((x 1))
  (eval (+ 1 x)))

&gt; Returns 2

(<span style="color: #a020f0;">let</span> ((x 1))
  (eval (+ 1 *y*)))

&gt; Returns 1

</pre>
</div>

<p>
The error in the first example is because <code>EVAL</code> does not have access to the lexical environment where X is defined. The second example works because (+ 1 X) has been evaluated prior to reaching eval, and as a regular form, it has access to the lexical variable x. In this instance, eval receives 2, which it then evaluates to 2. The final example above shows that EVAL does have access to the current dynamic environment, where we have defined <b>Y</b> as a dynamic variable.
</p>
</div>
</div>
