org/macros.org
** A Note on Macros

Macros are able to evaluate expressions within a lexical environment and thus provide much more powerful capabilities to delay evaluation. Thus, one of the key uses of macros is commonly known to be preventing, delaying and controlling evaluation. They are also more efficient as they do much of their work during compile-time, but that is a separate point that we discuss elsewhere in this article.

* The Backquote Reader Macros



* Destructuring

Destructuring allows you to bind multiple variables by specifying a pattern against the variable from which they are bound. This is best explained with an example. The below two forms are equivalent.

#+begin_src lisp

  (defparameter *list* '(1 2 3))

  (let ((x (first *list*))
	(y (second *list*))
	(z (third *list*)))
    (format nil "The first item is ~a, the second ~a and the third ~a" x y z))

  (destructuring-bind (x y z) *list*
    (format nil "The first item is ~a, the second ~a and the third ~a" x y z))

#+end_src

By naming each part of *​LIST*, we are able to /destructure/ it into its components (first, second and third items) and then bind them to the variables x, y and z. Hence, the name /destructuring-bind/. Let's try the following.

#+begin_src lisp

  (defparameter *list-2* '(1 2 3 4))

  (destructuring-bind (x y z) *list-2*
    (format nil "The first item is ~a, the second ~a and the third ~a" x y z))

  > Error - too many elements to satisfy lambda list

#+end_src

This error makes sense, we haven't correctly destructured *​LIST-2* which has four elements vs. the three we specified. A similar error would be thrown if *​LIST-2* had only two elements and not three, in which case we are trying to destructure too many elements. The destructuring must match exactly the form of the variable being destructured.

An astute reader may note now that every time we use a parameter list within a function, we are implicitly destructuring it into its component elements. Returning back to our topic of discussion, macros, the Common Lisp DEFMACRO facility allows parameter lists to be arbitrary list structures. By this, we mean we can take advantage of the following type of destructuring (taken from Page 94 of On Lisp).

#+begin_src lisp

  (defmacro our-dolist ((var list &optional result) &body body)
    `(progn
       (mapc #'(lambda (,var) ,@body) ,list)
       (let ((,var nil))
	 ,result)))

#+end_src

As the =DOLIST= macro allows for an optional result form, the first set of its arguments (var, list, result) must be enclosed in a distinct list as to separate the result form from the remaining body forms. However, as the above macro shows, this is no issue to us, as destructuring allows us to cleanly refer to each part of the (nested) parameter list, without any overhead in list processing. As with the other techniques shown here, our aim is to streamline macro code transformation as much as possible so that it is as easy as possible for readers and ourselves to read and understand. Macros are a complex topic, any (valid) simplification is worth its weight in gold.

* The Issue of Variable Capture

One of the challenges in writing macros is their susceptibility to /variable capture/, when macroexpansion causes a name to clash and some symbol ends up referring to a variable from another context. Inadvertent variable capture can cause extremely subtle bugs. Note that variable capture can also be used to your advantage, however we will not cover that here, and leave it to you to explore.

The following is a simple example of a =FOR= macro exposed to variable capture.

#+begin_src lisp

  (defmacro for ((var start stop) &body body)
    `(do ((,var ,start (1+ ,var))
	  (limit ,stop))
	 ((> ,var limit))
       ,@body))

#+end_src

It will work in most cases:

#+begin_src lisp

  (for (x 1 5)
    (print x))

#+end_src

But not if we use 'limit' as a variable name:

#+begin_src lisp

  (for (limit 1 5)
    (print x))

  > Error - The variable limit occurs more than once

#+end_src

The reason here is the name clash between the symbol local to the macro expansion, limit, and the symbol passed in as an argument (again limit). The above phenomena is expressed as the macroexpansion /capturing/ the limit variable. As per Paul Graham on page 119 (in fact much of this article is copying him), errors caused by variable capture are rea, but what they lack in frequency, they make up in viciousness. This capture was comparatively mild - here, at least, we got an error. More often than not, a capturing macro would simply yield incorrect results with no indication that anything was wrong. An example of this is the below.

#+begin_src lisp

  (let ((limit 5))
    (for (i 1 10)
      (when (> i limit)
	(print i))))

#+end_src

In the above case, instead of printing i five times, nothing is printed. Here, the limit variable internal to the macro shadows the outer value of limit, and thus instead of comparing i to 5 in the when form, i is being compared to 10, which it will never exceed by the setup of the above code.

** Avoding Variable Capture with GENSYM

I don't want to complicate things here, but much can be said about how to detect variable capture. I think the easiest way to note is that variable capture issues occur when symbols share the same name, and when that happens, you should carefully check whether the macro will result in inadvertent behaviour. Sometimes the behaviour is intended, so the best defense against variable capture is a sharp eye and programming experience. We will discuss now some strategies to avoiding variable capture.

*** Avoiding capture with correctly named special variables

It is customary practice that any global (that is, special) variables are named with enclosing asterisks (such as *​my-symbol-name*). This aids greatly in avoiding variable capture as a macro writer should be able to safely assume his variables will not clash with any special variables because of their different naming convention. Of course, this assumes everybody follows this naming convention, so please do so! It will save many headaches down the line, for yourself and others.

*** Avoiding capture with packages

If we define macros in their own package, we can segregate their symbols from other packages and thus avoid variable capture when other packages call these macros. However, this does not protect against variable capture caused by macro calls from other macros within the macro package, and also can burden the writer to separate his macros into their own package, when it makes more organisational sense to include together with the functions they work with.

