macros.html

<div id="outline-container-orgb921211" class="outline-3">
<h3 id="orgb921211">A Note on Macros</h3>
<div class="outline-text-3" id="text-orgb921211">
<p>
Macros are able to evaluate expressions within a lexical environment and thus provide much more powerful capabilities to delay evaluation. Thus, one of the key uses of macros is commonly known to be preventing, delaying and controlling evaluation. They are also more efficient as they do much of their work during compile-time, but that is a separate point that we discuss elsewhere in this article.
</p>
</div>
</div>
</div>

<div id="outline-container-org6dcffd5" class="outline-2">
<h2 id="org6dcffd5">The Backquote Reader Macros</h2>
</div>



<div id="outline-container-org9f873f5" class="outline-2">
<h2 id="org9f873f5">Destructuring</h2>
<div class="outline-text-2" id="text-org9f873f5">
<p>
Destructuring allows you to bind multiple variables by specifying a pattern against the variable from which they are bound. This is best explained with an example. The below two forms are equivalent.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*list*</span> '(1 2 3))

(<span style="color: #a020f0;">let</span> ((x (first *list*))
      (y (second *list*))
      (z (third *list*)))
  (format nil <span style="color: #8b2252;">"The first item is ~a, the second ~a and the third ~a"</span> x y z))

(<span style="color: #a020f0;">destructuring-bind</span> (x y z) *list*
  (format nil <span style="color: #8b2252;">"The first item is ~a, the second ~a and the third ~a"</span> x y z))

</pre>
</div>

<p>
By naming each part of *​LIST*, we are able to <i>destructure</i> it into its components (first, second and third items) and then bind them to the variables x, y and z. Hence, the name <i>destructuring-bind</i>. Let's try the following.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defparameter</span> <span style="color: #a0522d;">*list-2*</span> '(1 2 3 4))

(<span style="color: #a020f0;">destructuring-bind</span> (x y z) *list-2*
  (format nil <span style="color: #8b2252;">"The first item is ~a, the second ~a and the third ~a"</span> x y z))

&gt; Error - too many elements to satisfy lambda list

</pre>
</div>

<p>
This error makes sense, we haven't correctly destructured *​LIST-2* which has four elements vs. the three we specified. A similar error would be thrown if *​LIST-2* had only two elements and not three, in which case we are trying to destructure too many elements. The destructuring must match exactly the form of the variable being destructured.
</p>

<p>
An astute reader may note now that every time we use a parameter list within a function, we are implicitly destructuring it into its component elements. Returning back to our topic of discussion, macros, the Common Lisp DEFMACRO facility allows parameter lists to be arbitrary list structures. By this, we mean we can take advantage of the following type of destructuring (taken from Page 94 of On Lisp).
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">our-dolist</span> ((var list <span style="color: #228b22;">&amp;optional</span> result) <span style="color: #228b22;">&amp;body</span> body)
  `(<span style="color: #a020f0;">progn</span>
     (mapc #'(<span style="color: #a020f0;">lambda</span> (,var) ,@body) ,list)
     (<span style="color: #a020f0;">let</span> ((,var nil))
       ,result)))

</pre>
</div>

<p>
As the <code>DOLIST</code> macro allows for an optional result form, the first set of its arguments (var, list, result) must be enclosed in a distinct list as to separate the result form from the remaining body forms. However, as the above macro shows, this is no issue to us, as destructuring allows us to cleanly refer to each part of the (nested) parameter list, without any overhead in list processing. As with the other techniques shown here, our aim is to streamline macro code transformation as much as possible so that it is as easy as possible for readers and ourselves to read and understand. Macros are a complex topic, any (valid) simplification is worth its weight in gold.
</p>
</div>
</div>

<div id="outline-container-org4e2657f" class="outline-2">
<h2 id="org4e2657f">The Issue of Variable Capture</h2>
<div class="outline-text-2" id="text-org4e2657f">
<p>
One of the challenges in writing macros is their susceptibility to <i>variable capture</i>, when macroexpansion causes a name to clash and some symbol ends up referring to a variable from another context. Inadvertent variable capture can cause extremely subtle bugs. Note that variable capture can also be used to your advantage, however we will not cover that here, and leave it to you to explore.
</p>

<p>
The following is a simple example of a <code>FOR</code> macro exposed to variable capture.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">for</span> ((var start stop) <span style="color: #228b22;">&amp;body</span> body)
  `(<span style="color: #a020f0;">do</span> ((,var ,start (1+ ,var))
        (limit ,stop))
       ((&gt; ,var limit))
     ,@body))

</pre>
</div>

<p>
It will work in most cases:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(for (x 1 5)
  (print x))

</pre>
</div>

<p>
But not if we use 'limit' as a variable name:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(for (limit 1 5)
  (print x))

&gt; Error - The variable limit occurs more than once

</pre>
</div>

<p>
The reason here is the name clash between the symbol local to the macro expansion, limit, and the symbol passed in as an argument (again limit). The above phenomena is expressed as the macroexpansion <i>capturing</i> the limit variable. As per Paul Graham on page 119 (in fact much of this article is copying him), errors caused by variable capture are rea, but what they lack in frequency, they make up in viciousness. This capture was comparatively mild - here, at least, we got an error. More often than not, a capturing macro would simply yield incorrect results with no indication that anything was wrong. An example of this is the below.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">let</span> ((limit 5))
  (for (i 1 10)
    (<span style="color: #a020f0;">when</span> (&gt; i limit)
      (print i))))

</pre>
</div>

<p>
In the above case, instead of printing i five times, nothing is printed. Here, the limit variable internal to the macro shadows the outer value of limit, and thus instead of comparing i to 5 in the when form, i is being compared to 10, which it will never exceed by the setup of the above code.
</p>
</div>

<div id="outline-container-orge5970b7" class="outline-3">
<h3 id="orge5970b7">Avoding Variable Capture with GENSYM</h3>
<div class="outline-text-3" id="text-orge5970b7">
<p>
I don't want to complicate things here, but much can be said about how to detect variable capture. I think the easiest way to note is that variable capture issues occur when symbols share the same name, and when that happens, you should carefully check whether the macro will result in inadvertent behaviour. Sometimes the behaviour is intended, so the best defense against variable capture is a sharp eye and programming experience. We will discuss now some strategies to avoiding variable capture.
</p>
</div>

<div id="outline-container-orgebb573b" class="outline-4">
<h4 id="orgebb573b">Avoiding capture with correctly named special variables</h4>
<div class="outline-text-4" id="text-orgebb573b">
<p>
It is customary practice that any global (that is, special) variables are named with enclosing asterisks (such as *​my-symbol-name*). This aids greatly in avoiding variable capture as a macro writer should be able to safely assume his variables will not clash with any special variables because of their different naming convention. Of course, this assumes everybody follows this naming convention, so please do so! It will save many headaches down the line, for yourself and others.
</p>
</div>
</div>

<div id="outline-container-orgc0a902b" class="outline-4">
<h4 id="orgc0a902b">Avoiding capture with packages</h4>
<div class="outline-text-4" id="text-orgc0a902b">
<p>
If we define macros in their own package, we can segregate their symbols from other packages and thus avoid variable capture when other packages call these macros. However, this does not protect against variable capture caused by macro calls from other macros within the macro package, and also can burden the writer to separate his macros into their own package, when it makes more organisational sense to include together with the functions they work with.
</p>
</div>
</div>
