org/macros.org
*** Avoding capture with Gensyms

The Common Lisp function =GENSYM= is used to ensure a symbol is unique and thus aiding us in a certain way to avoid variable capture. It returns a symbol, called a /gensym/, which is guaranteed not to be EQ to any symbol either typed in or constructed by a program. Below is an illustrative example of using gensyms to avoid variable capture.

#+begin_src lisp

  (defmacro for ((var start stop) &body body)
    (let ((gstop (gensym)))
      `(do ((,var ,start (1+ ,var))
	    (,gstop , stop))
	   ((> ,var ,gstop))
	 ,@body)))

#+end_src



The first error above leads us to our next point about macros. We have discussed how DEFMACRO registers the macro and its macroexpansion in the global environment, but we didn't really build on this point. Let us do that now.

Lisp programs 

https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node59.html
https://mr.gy/ansi-common-lisp/index.html#Top
https://mr.gy/ansi-common-lisp/The-Evaluation-Model.html#The-Evaluation-Model

They are useful for /extending/ the language. Macros are special kinds of functions whose arguments are not evaluated. Macr *Functions* produce results, 

Right, (defmacro m (x) (list 'cons 234 111)) turns into something like (setf (macro-function 'm) (lambda (form environment) (list 'cons 234 111)))



When the compiler sees a macro call like (macrocall x y), what it basically does is (funcall (macro-function 'macrocall) '(macrocall x y) <some-environment>) and then it compiles the result of that call in place of the original (macrocall x y).




* The Quote and Backquote Operators






pjb: lisp123: note: don't use ` , and ,@ because those are reader macros, ie. they are text with syntax that needs to be parsed, and to use it, you need to build a text instead of a sexp!


