macros.html

<div id="outline-container-org452afb6" class="outline-4">
<h4 id="org452afb6">Avoding capture with Gensyms</h4>
<div class="outline-text-4" id="text-org452afb6">
<p>
The Common Lisp function <code>GENSYM</code> is used to ensure a symbol is unique and thus aiding us in a certain way to avoid variable capture. It returns a symbol, called a <i>gensym</i>, which is guaranteed not to be EQ to any symbol either typed in or constructed by a program. Below is an illustrative example of using gensyms to avoid variable capture.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">for</span> ((var start stop) <span style="color: #228b22;">&amp;body</span> body)
  (<span style="color: #a020f0;">let</span> ((gstop (gensym)))
    `(<span style="color: #a020f0;">do</span> ((,var ,start (1+ ,var))
          (,gstop , stop))
         ((&gt; ,var ,gstop))
       ,@body)))

</pre>
</div>



<p>
The first error above leads us to our next point about macros. We have discussed how DEFMACRO registers the macro and its macroexpansion in the global environment, but we didn't really build on this point. Let us do that now.
</p>

<p>
Lisp programs 
</p>

<p>
<a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node59.html">https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node59.html</a>
<a href="https://mr.gy/ansi-common-lisp/index.html#Top">https://mr.gy/ansi-common-lisp/index.html#Top</a>
<a href="https://mr.gy/ansi-common-lisp/The-Evaluation-Model.html#The-Evaluation-Model">https://mr.gy/ansi-common-lisp/The-Evaluation-Model.html#The-Evaluation-Model</a>
</p>

<p>
They are useful for <i>extending</i> the language. Macros are special kinds of functions whose arguments are not evaluated. Macr <b>Functions</b> produce results, 
</p>

<p>
Right, (defmacro m (x) (list 'cons 234 111)) turns into something like (setf (macro-function 'm) (lambda (form environment) (list 'cons 234 111)))
</p>



<p>
When the compiler sees a macro call like (macrocall x y), what it basically does is (funcall (macro-function 'macrocall) '(macrocall x y) &lt;some-environment&gt;) and then it compiles the result of that call in place of the original (macrocall x y).
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-orgd89231a" class="outline-2">
<h2 id="orgd89231a">The Quote and Backquote Operators</h2>
<div class="outline-text-2" id="text-orgd89231a">
<p>
pjb: lisp123: note: don't use ` , and ,@ because those are reader macros, ie. they are text with syntax that needs to be parsed, and to use it, you need to build a text instead of a sexp!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 10 September 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
